In [1]:
import pandas as pd
import random

In [2]:
titanic=pd.read_csv('datasets/train.csv')
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [3]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
# Now to convert the bool value from object to binary (0,1), like male/female will be (0,1).
titanic['Sex']= titanic["Sex"].replace(['male','female'],[0,1])
titanic['Embarked']= titanic["Embarked"].replace(['S','C','Q'],[0,1,2])
titanic['Embarked']=titanic['Embarked'].fillna(random.randint(1,3))

In [5]:
titanic['Fare'].describe()

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: Fare, dtype: float64

In [6]:
# here we are defining the range of age into a number so it will be easy to understand the range by number.
# like age=0  means below 5 , age=25 means below 25
titanic.loc[ titanic["Age"] <= 5, "Age"] = 0
titanic.loc[(titanic["Age"] > 5) & (titanic["Age"] <= 15), "Age"] = 1
titanic.loc[(titanic["Age"] > 15) & (titanic["Age"] <= 25), "Age"] = 2
titanic.loc[(titanic["Age"] > 25) & (titanic["Age"] <= 35), "Age"] = 3
titanic.loc[(titanic["Age"] > 35) & (titanic["Age"] <= 45), "Age"] = 4
titanic.loc[(titanic["Age"] > 45) & (titanic["Age"] <= 55), "Age"] = 5
titanic.loc[(titanic["Age"] > 55) & (titanic["Age"] <= 65), "Age"] = 6
titanic.loc[ titanic["Age"] > 65, "Age"] = 7

In [7]:
titanic["Age"]=titanic['Age'].fillna(random.randint(0,7))

In [8]:
titanic["Age"]=titanic['Age'].astype(int)

In [9]:
titanic["Age"]

0      2
1      4
2      3
3      3
4      3
      ..
886    3
887    2
888    7
889    3
890    3
Name: Age, Length: 891, dtype: int64

In [37]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score,precision_score,recall_score,confusion_matrix,classification_report

In [38]:
X=titanic[['Pclass','Sex','Age','SibSp','Parch','Fare','Embarked']]
y=titanic['Survived']

In [39]:
x_train,x_test,y_train,y_test=train_test_split(X,y,test_size=0.469)

In [40]:
y_test

23     1
672    0
563    0
826    0
410    0
      ..
328    1
566    0
151    1
550    1
360    0
Name: Survived, Length: 418, dtype: int64

In [41]:
lr=LogisticRegression(penalty='l2',C=1,solver="liblinear")
lr.fit(x_train,y_train)

LogisticRegression(C=1, solver='liblinear')

In [42]:
predicted_value=lr.predict(x_test)
predicted_value

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0,
       0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1,
       0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1,
       0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0,
       0, 1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1,
       0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1,
       1, 1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1,
       0, 0, 1, 0, 1, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0,
       0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1,
       0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1,
       1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1,
       0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0,
       0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1,
       0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1,
       0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1, 0, 1, 0, 1,
       0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0,
       0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 0, 1, 1, 0])

In [43]:
# plotting the comparison or difference between actual value and predicted value.
comparison=pd.DataFrame({'Actual value':y_test,'Predicted value':predicted_value})
comparison

     Actual value  Predicted value
23              1                0
672             0                0
563             0                0
826             0                0
410             0                0
..            ...              ...
328             1                1
566             0                0
151             1                1
550             1                1
360             0                0

[418 rows x 2 columns]

In [44]:
print(" the Accuracy Score is: ",accuracy_score(y_test,predicted_value))
print(" the precision Score is: ",precision_score(y_test,predicted_value))
print(" the recall Score is: ",recall_score(y_test,predicted_value))

 the Accuracy Score is:  0.7966507177033493
 the precision Score is:  0.7591240875912408
 the recall Score is:  0.6666666666666666

In [47]:
print(confusion_matrix(y_test,predicted_value))

[[229  33]
 [ 52 104]]

In [46]:
print(classification_report(y_test,predicted_value))

              precision    recall  f1-score   support

           0       0.81      0.87      0.84       262
           1       0.76      0.67      0.71       156

    accuracy                           0.80       418
   macro avg       0.79      0.77      0.78       418
weighted avg       0.79      0.80      0.79       418

In [34]:
output= pd.DataFrame({"Survived": predicted_value})

In [35]:
output.to_csv('result.csv',index=False)

In [48]:
import seaborn as sns